tests/com/l7tech/service/resources/sampleSignedSamlHolderOfKeyRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="true"><wsu:Timestamp wsu:Id="Timestamp-1-099375bd0a0faf61c9a5d4eaa335ec50"><wsu:Created>2004-08-13T22:56:57.171Z</wsu:Created><wsu:Expires>2004-08-13T23:01:57.171Z</wsu:Expires></wsu:Timestamp><saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" AssertionID="BinarySecurityToken-2-cfa72a43b2cca3a7de599c4e7788599e" IssueInstant="2004-08-13T22:56:57.343Z" Issuer="Service Provider" MajorVersion="1" MinorVersion="1"><saml:Conditions NotBefore="2004-08-13T22:56:00.000Z" NotOnOrAfter="2004-08-13T22:01:00.000Z"></saml:Conditions><saml:AuthenticationStatement AuthenticationInstant="2004-08-13T22:56:57.343Z" AuthenticationMethod="urn:ietf:rfc:3075"><saml:Subject><saml:NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=John Smith, OU=Java Technology Center, O=IBM, L=Cupertino, ST=California, C=US</saml:NameIdentifier><saml:SubjectConfirmation><saml:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key</saml:ConfirmationMethod><xd:KeyInfo xmlns:xd="http://www.w3.org/2000/09/xmldsig#"><xd:X509Data><xd:X509SubjectName>CN=John Smith, OU=Java Technology Center, O=IBM, L=Cupertino, ST=California, C=US</xd:X509SubjectName><xd:X509Certificate>MIICZjCCAc8CBD2+61QwDQYJKoZIhvcNAQEEBQAwejELMAkGA1UEBhMCVVMxEzARBgNVBAgTCkNhbGlmb3JuaWExEjAQBgNVBAcTCUN1cGVydGlubzEMMAoGA1UEChMDSUJNMR8wHQYDVQQLExZKYXZhIFRlY2hub2xvZ3kgQ2VudGVyMRMwEQYDVQQDEwpKb2huIFNtaXRoMB4XDTAyMTAyOTIwMTEwMFoXDTA3MTAwMzIwMTEwMFowejELMAkGA1UEBhMCVVMxEzARBgNVBAgTCkNhbGlmb3JuaWExEjAQBgNVBAcTCUN1cGVydGlubzEMMAoGA1UEChMDSUJNMR8wHQYDVQQLExZKYXZhIFRlY2hub2xvZ3kgQ2VudGVyMRMwEQYDVQQDEwpKb2huIFNtaXRoMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCtitis5FONvv236Xw1CKOvKAOQ0NYlvRd/FKwuf+T1XCFadHMrtvHhq/+Z/Dlcn2YQYOCp9auS+WkBcL0AUrJJPUbwZIB2CyBZJjnS7+jdb37RKYQUsNRNlgdIcoZM8bvCZldBSfnat4xDPyQOJB7ExDrMmI9tP0NY9GN0npfnwwIDAQABMA0GCSqGSIb3DQEBBAUAA4GBAFLNrEP8Y0xwUVIl4XigEiDM6jAdDJFCI+m8EA07nAsYWmV/Ic8kkqDzXaWyLkIBJQ0gElRlWHYe+W/K/pT9CNEWRFViKbZGevivBKek7GQXhuEgo+pWalpEtg4nA741+46iKeKpEQILL6OYEj7aHcreIxaQ1WH2v1iMig33Q0+S</xd:X509Certificate></xd:X509Data></xd:KeyInfo></saml:SubjectConfirmation></saml:Subject><saml:SubjectLocality DNSAddress="Data.l7tech.com" IPAddress="192.168.1.221"></saml:SubjectLocality></saml:AuthenticationStatement><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
  <ds:SignedInfo>
    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod>
    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod>
    <ds:Reference URI="#BinarySecurityToken-2-cfa72a43b2cca3a7de599c4e7788599e">
      <ds:Transforms>
        <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"></ds:Transform>
        <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform>
      </ds:Transforms>
      <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
      <ds:DigestValue>B6GHeBRlVG1o9uQhXy6izL5fIVI=</ds:DigestValue>
    </ds:Reference>
  </ds:SignedInfo>
  <ds:SignatureValue>
    gS0puyJuXc1uB3BaSN/O2SnmTFObfZM7qKGcl338zm2wubC8t0ZZaVJJn8bTr9xLqxs2pQW/
    lFyVGxTmdCs//ovewT23kaUhbTo2Ny7YAWoeBnNNyWR4AV2Q8/K2jTecLqgdcqeeUYbkNBNV
    CcyKc+lU7Yfi1Fix4ZIvSdA0mMg=
  </ds:SignatureValue>
<KeyInfo>
    <X509Data>
      <X509SubjectName>CN=Service Provider,C=US</X509SubjectName>
      <X509Certificate>
MIIBwjCCASsCBD2+61wwDQYJKoZIhvcNAQEEBQAwKDELMAkGA1UEBhMCVVMxGTAXBgNVBAMTEFNl
cnZpY2UgUHJvdmlkZXIwHhcNMDIxMDI5MjAxMTA4WhcNMDcxMDAzMjAxMTA4WjAoMQswCQYDVQQG
EwJVUzEZMBcGA1UEAxMQU2VydmljZSBQcm92aWRlcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkC
gYEAo0XigmhYEI5e3zBQRH/268+QytTtZaelah0y1ZTQMJFxKo3ZUSlfC4RXwfzDX+6r8qMp0Dz3
VMpzLESayCYYhO/HZiqvnj6XmPmMbMqSFfayBvRmLbaSXNgi2BaTcD5S54EiLWBpXCUkhJUTuEqz
DmZPP4djjip4i0PDkd1ido8CAwEAATANBgkqhkiG9w0BAQQFAAOBgQCgjZ5WzQUo0nuilpRUUbqN
654ZEvq3bdUCdGn9UEa6IfczMhQNfOWW1182ksx0tcUKAw3yAzaNJeUjhONQc+NiF3QDohf1yECy
RcDG0Z8mBoZM5VGO3ezgRj6gNKNr6CtJM23WSxtLYM1xzONDaKwiaU965fh8t0bA7EoUAaxETA==
      </X509Certificate>
    </X509Data>
  </KeyInfo></ds:Signature></saml:Assertion><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
  <ds:SignedInfo>
    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""></c14n:InclusiveNamespaces></ds:CanonicalizationMethod>
    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod>
    <ds:Reference URI="#Body-0-fe32d312234ae9421e105ba4e3380675">
      <ds:Transforms>
        <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""></c14n:InclusiveNamespaces></ds:Transform>
      </ds:Transforms>
      <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
      <ds:DigestValue>BFKPTBIpj7RaYlDNNpFjf9HxODA=</ds:DigestValue>
    </ds:Reference>
    <ds:Reference URI="#Timestamp-1-099375bd0a0faf61c9a5d4eaa335ec50">
      <ds:Transforms>
        <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""></c14n:InclusiveNamespaces></ds:Transform>
      </ds:Transforms>
      <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
      <ds:DigestValue>3/J/AN6q4JM37gNkzPRbFAATLVU=</ds:DigestValue>
    </ds:Reference>
  </ds:SignedInfo>
  <ds:SignatureValue>
    j1/VkxmFA8+OdQiw8wd51Dk5GeaPfERNLq6iJQLpNKz4rY3QXTDIkROy0dAOgMdRcOwDSnr1
    mWJWmgfzRJqnNIt/Jw94j/7QkLi8jcxemfFTFVxBpHfJVLSOhdRrO9VLBMyiSP0BVeDslUIu
    ZyVbI1c4m3bLhuzEH8EXrIUs3O4=
  </ds:SignatureValue>
<ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#BinarySecurityToken-2-cfa72a43b2cca3a7de599c4e7788599e" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"></wsse:Reference></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Body-0-fe32d312234ae9421e105ba4e3380675">
        <ns1:placeOrder xmlns:ns1="http://warehouse.acme.com/ws" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <productid xsi:type="xsd:long">-9206260647417300294</productid>
            <amount xsi:type="xsd:long">1</amount>
            <price xsi:type="xsd:float">5.0</price>
            <accountid xsi:type="xsd:long">228</accountid>
        </ns1:placeOrder>
    </soapenv:Body>
</soapenv:Envelope>
